Autodesk.Revit.DB.DisplayUnitType
The units and display format used to format numbers as strings.  Also used for unit conversions.
Remarks:
Display units are used for two purposes:
Formatting and parsing string representations of values.  See
FormatOptions.DisplayUnit and the formatting and parsing utilities
in the UnitFormatUtils class.
Conversion of values from one unit to another.  See the unit
conversion utilities in the UnitUtils class.
Most display units represent simple units like meters, square
feet, or degrees, and are formatted as decimal numbers.  Some
display units represent specialized formatting methods like "feet
and fractional inches" or "degrees, minutes and seconds".  Such
display units still correspond to an underlying simple unit when
used with the conversion utilities.

Autodesk.Revit.DB.DisplayUnitType.DUT_RANKINE_DIFFERENCE
degree Rankine difference (delta °R)

Autodesk.Revit.DB.DisplayUnitType.DUT_KELVIN_DIFFERENCE
kelvin difference (delta K)

Autodesk.Revit.DB.DisplayUnitType.DUT_CELSIUS_DIFFERENCE
degree Celsius difference (delta °C)

Autodesk.Revit.DB.DisplayUnitType.DUT_FAHRENHEIT_DIFFERENCE
degree Fahrenheit difference (delta °F)

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_MINUTE
liters per minute (L/min)

Autodesk.Revit.DB.DisplayUnitType.DUT_USTONNES_FORCE
US tonnes (Tonsf, STf)

Autodesk.Revit.DB.DisplayUnitType.DUT_USTONNES_MASS
US tonnes (T, Tons, ST)

Autodesk.Revit.DB.DisplayUnitType.DUT_MICROINCHES_PER_INCH_FAHRENHEIT
Microinches per inch Fahrenheit (uin/(in·°F))

Autodesk.Revit.DB.DisplayUnitType.DUT_MICROMETERS_PER_METER_CELSIUS
Micrometers per meter Celsius (um/(m·°C))

Autodesk.Revit.DB.DisplayUnitType.DUT_JOULES_PER_KILOGRAM_CELSIUS
Joules per kilogram Celsius (J/(kg·°C))

Autodesk.Revit.DB.DisplayUnitType.DUT_DECIMETERS
Decimeters

Autodesk.Revit.DB.DisplayUnitType.DUT_PER_MILLE
Per mille or per thousand(‰)

Autodesk.Revit.DB.DisplayUnitType.DUT_GRAINS_PER_HOUR_SQUARE_FOOT_INCH_MERCURY
Grains per hour square foot inch mercury (gr/(h·ft²·inHg))

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_POUND
BTU per pound (BTU/lb)

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_POUND_FAHRENHEIT
BTU per pound Fahrenheit (BTU/(lb·°F))

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR_FOOT_FAHRENHEIT
BTU per hour foot Fahrenheit (BTU/(h·ft·°F))

Autodesk.Revit.DB.DisplayUnitType.DUT_OHM_METERS
Ohm meters

Autodesk.Revit.DB.DisplayUnitType.DUT_NANOGRAMS_PER_PASCAL_SECOND_SQUARE_METER
Nanograms per pascal second square meter (ng/(Pa·s·m²))

Autodesk.Revit.DB.DisplayUnitType.DUT_JOULES_PER_GRAM
Joules per gram (J/g)

Autodesk.Revit.DB.DisplayUnitType.DUT_JOULES_PER_GRAM_CELSIUS
Joules per gram Celsius (J/(g·°C))

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_METER_KELVIN
Watts per meter kelvin (W/(m·K))

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_SQUARE_FOOT
pounds per square foot (lb/ft²)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOGRAMS_MASS_PER_SQUARE_METER
kilograms per square meter (kg/m²)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOJOULES
kilojoules

Autodesk.Revit.DB.DisplayUnitType.DUT_MILES_PER_HOUR
miles per hour

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOMETERS_PER_HOUR
kilometers per hour

Autodesk.Revit.DB.DisplayUnitType.DUT_HOURS
hours

Autodesk.Revit.DB.DisplayUnitType.DUT_MINUTES
minutes

Autodesk.Revit.DB.DisplayUnitType.DUT_SECONDS
second

Autodesk.Revit.DB.DisplayUnitType.DUT_MILISECONDS
millisecond

Autodesk.Revit.DB.DisplayUnitType.DUT_RADIANS_PER_SECOND
radians per second

Autodesk.Revit.DB.DisplayUnitType.DUT_GRADS
grads

Autodesk.Revit.DB.DisplayUnitType.DUT_RADIANS
radians

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_FOOT
pounds per foot (lb/ft)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOGRAMS_MASS_PER_METER
kilograms per meter (kg/m)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_METERS_PER_METER
square meters per meter	(m²/m)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_CENTIMETERS_PER_METER
square centimeters per meter	(cm²/m)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_MILLIMETERS_PER_METER
square millimeters per meter	(mm²/m)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_INCHES_PER_FOOT
square inches per foot	(in²/ft)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_FEET_PER_FOOT
square feet per foot	(ft²/ft)

Autodesk.Revit.DB.DisplayUnitType.DUT_METERS_TO_THE_SIXTH_POWER
meters to the sixth power	(m^6)

Autodesk.Revit.DB.DisplayUnitType.DUT_CENTIMETERS_TO_THE_SIXTH_POWER
centimeters to the sixth power	(cm^6)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILLIMETERS_TO_THE_SIXTH_POWER
millimeters to the sixth power	(mm^6)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_TO_THE_SIXTH_POWER
inches to the sixth power	(in^6)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_TO_THE_SIXTH_POWER
feet to the sixth power	(ft^6)

Autodesk.Revit.DB.DisplayUnitType.DUT_METERS_TO_THE_FOURTH_POWER
Meters to the fourth power	(m^4)

Autodesk.Revit.DB.DisplayUnitType.DUT_CENTIMETERS_TO_THE_FOURTH_POWER
centimeters to the fourth power	(cm^4)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILLIMETERS_TO_THE_FOURTH_POWER
millimeters to the fourth power	(mm^4)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_TO_THE_FOURTH_POWER
inches to the fourth power	(in^4)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_TO_THE_FOURTH_POWER
feet to the fourth power	(ft^4)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILES_PER_SECOND_SQUARED
miles per second squared (mi/s²)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_PER_SECOND_SQUARED
feet per second squared (ft/s²)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_PER_SECOND_SQUARED
inches per second squared (in/s²)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOMETERS_PER_SECOND_SQUARED
kilometers per second squared (km/s²)

Autodesk.Revit.DB.DisplayUnitType.DUT_METERS_PER_SECOND_SQUARED
meters per second squared (m/s²)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS
pounds (lb)

Autodesk.Revit.DB.DisplayUnitType.DUT_TONNES_MASS
tonnes (t)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOGRAMS_MASS
kilograms (kg)

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_FEET_PER_THOUSAND_BRITISH_THERMAL_UNITS_PER_HOUR
square foot per thousand British thermal unit[IT] per hour

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_METERS_PER_KILOWATTS
square meter per kilowatt

Autodesk.Revit.DB.DisplayUnitType.DUT_SQUARE_FEET_PER_TON_OF_REFRIGERATION
square foot per ton of refrigeration

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_SECOND_KILOWATTS
liter per second kilowatt

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_FEET_PER_MINUTE_TON_OF_REFRIGERATION
cubic foot per minute ton of refrigeration

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_SECOND_CUBIC_METER
liter per second cubic meter

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_FEET_PER_MINUTE_CUBIC_FOOT
cubic foot per minute cubic foot

Autodesk.Revit.DB.DisplayUnitType.DUT_TON_OF_REFRIGERATION
Ton of refrigeration (12 000 Btu[IT]/h)

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR_CUBIC_FOOT
British thermal unit[IT] per hour cubic foot (Btu[IT]/(h · ft³)

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR_SQUARE_FOOT
British thermal unit[IT] per hour square foot (Btu[IT]/(h · ft²)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_CUBIC_METER
watt per cubic meter (W/m³)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_CUBIC_FOOT
watt per cubic foot (W/m³)

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_SECOND_SQUARE_METER
liter per second square meter

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_FEET_PER_MINUTE_SQUARE_FOOT
cubic foot per minute square foot

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR_SQUARE_FOOT_FAHRENHEIT
British thermal unit[IT] per hour square foot degree Fahrenheit (Btu[IT]/(h · ft² · °F)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_SQUARE_METER_KELVIN
watt per square meter kelvin (W/(m² · K))

Autodesk.Revit.DB.DisplayUnitType.DUT_KIPS_PER_CUBIC_FOOT
pound per cubic foot (kip/ft³)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_FOOT_HOUR
pound per foot hour (lb/(ft · h))

Autodesk.Revit.DB.DisplayUnitType.DUT_KIPS_PER_CUBIC_INCH
pound per cubic foot (kip/in³)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_FORCE_PER_CUBIC_FOOT
pound per cubic foot (kip/ft³)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILONEWTONS_PER_CUBIC_METER
kilnewtons per cubic meter (kN/m³)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_PER_SECOND
foot per second (ft/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_CENTIPOISES
centipoise (cP)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_FOOT_SECOND
pound per foot second (lb/(ft · s))

Autodesk.Revit.DB.DisplayUnitType.DUT_PASCAL_SECONDS
pascal second (Pa · s)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_OF_WATER
foot of water  conventional (ftH2O)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_OF_WATER_PER_100FT
foot of water  conventional (ftH2O) per 100 ft

Autodesk.Revit.DB.DisplayUnitType.DUT_HORSEPOWER
horsepower (550 ft · lbf/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_LUMENS
lumen (lm)

Autodesk.Revit.DB.DisplayUnitType.DUT_CANDLEPOWER
obsolete

Autodesk.Revit.DB.DisplayUnitType.DUT_CANDELAS
candela (cd)

Autodesk.Revit.DB.DisplayUnitType.DUT_CANDELAS_PER_SQUARE_METER
candela per square meter (cd/m²)

Autodesk.Revit.DB.DisplayUnitType.DUT_FOOTLAMBERTS
footlambert

Autodesk.Revit.DB.DisplayUnitType.DUT_FOOTCANDLES
footcandle

Autodesk.Revit.DB.DisplayUnitType.DUT_LUX
lux (lx)

Autodesk.Revit.DB.DisplayUnitType.DUT_HERTZ
hertz (Hz)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILLIVOLTS
millivolt (mV)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOVOLTS
kilovolt (kV)

Autodesk.Revit.DB.DisplayUnitType.DUT_VOLTS
volt (V)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILLIAMPERES
milliampere (mA)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOAMPERES
kiloampere (kA)

Autodesk.Revit.DB.DisplayUnitType.DUT_AMPERES
ampere (A)

Autodesk.Revit.DB.DisplayUnitType.DUT_GALLONS_US_PER_HOUR
gallon (U.S.) per hour (gph) (gal/h)

Autodesk.Revit.DB.DisplayUnitType.DUT_GALLONS_US_PER_MINUTE
gallon (U.S.) per minute (gpm) (gal/min)

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_METERS_PER_HOUR
cubic meters per hour (m³/h)

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_METERS_PER_SECOND
cubic meter per second (m³/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_SECOND
liter per second (L/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_FEET_PER_MINUTE
cubic foot per minute (ft³/min)

Autodesk.Revit.DB.DisplayUnitType.DUT_CENTIMETERS_PER_MINUTE
centimeter per minute (cm/min)

Autodesk.Revit.DB.DisplayUnitType.DUT_METERS_PER_SECOND
meter per second (m/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_FEET_PER_MINUTE
foot per minute (ft/min)

Autodesk.Revit.DB.DisplayUnitType.DUT_RANKINE
degree Rankine (°R)

Autodesk.Revit.DB.DisplayUnitType.DUT_KELVIN
kelvin (K)

Autodesk.Revit.DB.DisplayUnitType.DUT_CELSIUS
degree Celsius (°C)

Autodesk.Revit.DB.DisplayUnitType.DUT_FAHRENHEIT
degree Fahrenheit (°F)

Autodesk.Revit.DB.DisplayUnitType.DUT_BARS
bar (bar)

Autodesk.Revit.DB.DisplayUnitType.DUT_ATMOSPHERES
atmosphere  standard (atm)

Autodesk.Revit.DB.DisplayUnitType.DUT_MILLIMETERS_OF_MERCURY
millimeter of mercury  conventional (mmHg)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_OF_MERCURY
inch of mercury  conventional (inHg)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_FORCE_PER_SQUARE_INCH
pound-force per square inch (psi) (lbf/in2)

Autodesk.Revit.DB.DisplayUnitType.DUT_MEGAPASCALS
megapascal (MPa)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOPASCALS
kilopascal (kPa)

Autodesk.Revit.DB.DisplayUnitType.DUT_PASCALS
pascal (Pa)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_OF_WATER
inch of water (60.8°F)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_SQUARE_METER
watt per square meter (W/m²)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS_PER_SQUARE_FOOT
watt per square foot (W/ft²)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOCALORIES_PER_SECOND
kilocalorie[IT] per second (kcal[IT]/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_CALORIES_PER_SECOND
calorie[IT] per second (cal[IT]/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR
British thermal unit[IT] per hour (Btu[IT]/h)

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_SECOND
British thermal unit[IT] per second (Btu[IT]/s)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOWATTS
kilowatt (kW)

Autodesk.Revit.DB.DisplayUnitType.DUT_WATTS
watt (W)

Autodesk.Revit.DB.DisplayUnitType.DUT_PASCALS_PER_METER
pascal per meter (N/m)

Autodesk.Revit.DB.DisplayUnitType.DUT_INCHES_OF_WATER_PER_100FT
Inches of water per 100 feet

Autodesk.Revit.DB.DisplayUnitType.DUT_THERMS
therm (EC)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOWATT_HOURS
kilowatt hour (kW · h)

Autodesk.Revit.DB.DisplayUnitType.DUT_JOULES
joule (J)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOCALORIES
kilocalorie[IT] (kcal[IT])

Autodesk.Revit.DB.DisplayUnitType.DUT_CALORIES
calorie[IT] (cal[IT])

Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS
British thermal unit[IT] (Btu[IT])

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_CUBIC_INCH
pound per cubic inch (lb/in³)

Autodesk.Revit.DB.DisplayUnitType.DUT_POUNDS_MASS_PER_CUBIC_FOOT
pound per cubic foot (lb/ft³)

Autodesk.Revit.DB.DisplayUnitType.DUT_KILOGRAMS_PER_CUBIC_METER
kilogram per cubic meter (kg/m³)

Autodesk.Revit.DB.DisplayUnitType.DUT_GALLONS_US
gallon (U.S.) (gal)

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS
liter (L)